#!/usr/bin/env python3
import sys

n = 0b1111
r = 0b1111 / 2
r = int(r)
print(r)

pos = [0, 1]
stack = [[0, 1], [1, 0]]
print(pos == stack[0])
print(pos[:])

pos = 0
if pos:
    print(0)

pos = (0, 1)
next_pos = [0, 1]
print(pos[0] == next_pos[0], pos[1] == next_pos[1])


print(int(13 / 4 % 2))

data = sys.stdin.read()
print(data)

# print( '▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎')
# print( '█', '  ', '█  █  █  █  █  █  █  █', sep='')
# print( '▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎▄︎')
# print( '█', '  ', '█  █  █  █  █  █  █  █', sep='')
# print( '█▀︎▀︎▀︎▀︎▀︎▀︎█  █  █  █  █  █  █  █')
# print( '█      █  █  █  █  █  █  █  █')
# print( '█      █  █  █  █  █  █  █  █')
# print( '█▄︎▄︎▄︎▄︎▄︎▄︎█  █  █  █  █  █  █  █')
# print( '█      █  █  █  █  █  █  █  █')
# print( '█▄︎▄︎█  █  █  █  █  █  █  █')
# print( '█  █  █  █  █  █  █  █  █')
# print( '█▀︎▀︎█  █  █  █  █  █  █  █')
# print( '█▄︎▄︎█  █  █  █  █  █  █  █')
# print( '█  █  █  █  █  █  █  █  █')
# print( '▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎▀︎')
# print( '█▄︎▄︎█▄︎▄︎█▄︎▄︎█▄︎▄︎█▄︎▄︎█▄︎▄︎█▄︎▄︎█▄︎▄︎█')
